[{"writer": "UUID", "title": "Welcome", "timestamp": "2017-10-05T00:00:00.000000+00:00", "content": "Welcome to Thought Writer, a community post board for you to write your ideas for the world to see. You can also create your own private posts or comment on others' posts. Click the yellow paper icon to get started!", "comments": [{"commenter": "UUID", "timestamp": "2018-02-26T20:42:31.652205+00:00", "content": "We are excited to have you here!"}]}, {"writer": "UUID", "title": "Thought Writer Tips", "timestamp": "2018-02-11T18:02:53.665412+00:00", "content": "You might be wondering how to best use Thought Writer. Here are some tips to help you get started:<div><ul><li>To change the <font color=\"#ff00ff\">color</font> of your text, select your text, then click the <u><b>A</b></u>&nbsp;button on the format toolbar and choose a color.</li><li>To make your text <b>bold</b>, select your text, then click the <b>B</b>&nbsp;button on the format toolbar. Do the same with the <b>I</b>&nbsp;button for <i>italicizing</i> your text, the <b><u>U</u></b>&nbsp;button for <u>underlining</u> your text, and the <strike style=\"font-weight: bold;\">S</strike> button for <strike>striking through</strike> your text.</li><li>To <sub>subscript</sub> your text, select your text, then click the <b>x<sub>2</sub></b> button. Do the same with the <b>x<sup>2</sup></b> button to <sup>superscript</sup> your text.</li><li>To align your text, select your text and click any of the <b>alignment</b> buttons on the format toolbar (left align, center align, right align, justify).</li><li>To add a numbered list to your text, click the <b>numbered list</b> button. to add a bullet-pointed list to your text, click the <b>bullet-pointed list</b> button.</li><li>To add a link&nbsp;to your text, click the <b>hyperlink (chain)</b> button and add a URL for your link.</li><li>To remove a link from your text, select the link, then click the&nbsp;<b>unlink (broken chain)</b>&nbsp;button.</li><li>To add an image to your text, click the&nbsp;<b>image (file)</b> button and add a URL for your image.</li><li>To clear your post of all formatting, select your text, then click the <b>x</b> button on the format toolbar.</li></ul><div>Do you have any tips that we missed? Post them in the comments!</div></div>", "comments": []}, {"writer": "UUID", "title": "Timespace", "timestamp": "2018-02-11T18:35:55.205966+00:00", "content": "Have you checked out the <font color=\"#1c50ff\"><b style=\"\"><a href=\"https://crystalprism.io/timespace/\" style=\"\"><u style=\"\">Timespace</u></a></b> </font>project yet? If not, here is a brief overview.<div><br></div><div>Timespace is a clock with four moving circles. Every second, each circle moves to a different x- and y-coordinate on the page and changes color. The coordinates are seemingly random, but they are actually based on digits in the Unix epoch for the current time. The colors are also seemingly random, but they are actually hexadecimal codes that are also based on the Unix epoch.</div><div><br></div><div>If you click the speaker icon at the top of the page, you can hear distant sounds in the background, which are from a recording of Saturn's rings.</div><div><br></div><div>There is also a T. S. Eliot quote on the page (\"It is only in the world of objects that we have time and space and selves.\"). Timespace depicts time through the movement of objects, but the objects would not move without time, and we would not necessarily know that time is moving if we didn't have markers to measure its passage (numbers, Earth's movement around the sun, etc.).</div><div><br></div><div>Have any thoughts on Timespace or the ideas it explores? Post them in the comments!</div>", "comments": []}, {"writer": "UUID", "title": "Shapes in Rain", "timestamp": "2018-02-11T18:40:55.268599+00:00", "content": "If you haven't checked out <font color=\"#ff0000\" style=\"\"><b><a href=\"https://crystalprism.io/shapes-in-rain\"><u>Shapes in Rain</u></a></b></font>, you should!<div><br></div><div>Shapes in Rain is a game in which random shapes appear on the page for you to click. When you click a shape, it disappears from the page, and your score increases. Shapes appear every few seconds, and if you don't clear them, they will disappear on their own.</div><div><br></div><div>You can hear calming piano music if you click the speaker icon at the top of the page. The music has rain sounds in the background, to go with the heart rain that falls in the background of the page.</div><div><br></div><div>If you have a Crystal Prism account, log in before you play the game to save your score. When you close the page, your score will automatically get recorded.</div><div><br></div><div>What do you think of Shapes in Rain? Post your comments below!</div>", "comments": []}, {"writer": "UUID", "title": "Rhythm of Life", "timestamp": "2018-02-11T18:48:46.364289+00:00", "content": "Have you played <font color=\"#00b700\"><u style=\"\"><b><a href=\"https://crystalprism.io/rhythm-of-life\">Rhythm of Life</a></b></u></font> yet?<div><br></div><div>Rhythm of Life is a game in which you are a heart that moves up, down, left and right on a screen and has to avoid stressors and seek out relievers to&nbsp;ensure your&nbsp;blood pressure remains low. As you move, your lifespan increases each second, and your goal is to have the highest lifespan you can.</div><div><br></div><div>As you move, stressors will follow you around the screen and increase your blood pressure and speed up the game if they collide with you. As you reach certain blood pressure levels, your heart rate increases (if you have your sound on) and the color of your heart changes from green to yellow, yellow to orange, and orange to red. Once you reach hypertensive levels, the game ends. If you have a Crystal Prism account, log in before you play to save your scores, which are automatically recorded each time the game ends.</div><div><br></div><div>To lower your blood pressure and increase your lifespan through the game, collide with relievers. Colliding with relievers will also slow down the game. Stressors can also collide with relievers, however, which will remove them from the screen and speed up the game.</div><div><br></div><div>If you want more information about stressors and relievers and how they affect your blood pressure, you can click the Learn More button.</div><div><br></div><div>Have any thoughts on Rhythm of Life? Post them in the comments below!</div>", "comments": []}, {"writer": "UUID", "title": "CanvaShare", "timestamp": "2018-02-11T19:00:40.517818+00:00", "content": "Have you created a drawing with <b><a href=\"https://crystalprism.io/canvashare\"><u><font color=\"#6e57ff\">CanvaShare</font></u></a></b> yet?<div><br></div><div>CanvaShare is a drawing gallery in which you can post drawings, like others' drawings, and iterate on others' drawings to make them your own.</div><div><br></div><div>If you have a Crystal Prism account, log in, and you can click the heart icon under any of the drawings in the gallery to like them. Click again to unlike the drawing. You can view the drawings you've liked on your My Account page, in the Drawings &gt; Liked menu.</div><div><br></div><div>To create a drawing of your own from scratch, click the <font color=\"#00ec86\" style=\"\">+</font> icon in the bottom-right corner of the gallery page to pop up the drawing menu. Click the white circle with the <b>+</b> icon to&nbsp;go to the easel page with a blank canvas. You can create a drawing using colors from any of the pallets listed. Click a pallet to see the colors included, and click a color to change that to your current drawing color. Click and drag your mouse on the easel to create your drawing. You can&nbsp;enter a title for your drawing above the easel. You can then download your drawing by clicking the <b>Download</b>&nbsp;button and/or post your drawing to the gallery by clicking the <b>Post </b>button below the easel. To start over, click the <b>Clear</b>&nbsp;button.</div><div><br></div><div>If you don't want to finish your drawing right away, you can come back to it at another time by going to the gallery page and&nbsp;clicking the&nbsp;<font color=\"#00ec86\">+</font>&nbsp;icon in the bottom-right corner of the gallery page to pop up the drawing menu. Click the white circle with the <b>arrow</b> icon to&nbsp;go to the easel page and continue your drawing.</div><div><br></div><div>If you see another user's drawing on the gallery page that you would like to iterate on, you can click the drawing to go to the easel page with that drawing as your starting canvas. Iterate on the drawing and give it your own title before downloading it and/or posting it to the gallery.</div><div><br></div><div>Have any thoughts on CanvaShare? Post them in the comments below!</div>", "comments": []}, {"writer": "UUID", "title": "Vicarious", "timestamp": "2018-02-11T19:07:53.770007+00:00", "content": "Have you checked out <b><u><a href=\"https://crystalprism.io/vicarious\"><font color=\"#ffd400\">Vicarious</font></a></u></b> yet?<div><br></div><div>Vicarious is a database where you can look up places you want to travel to and see pictures of them that were taken by people on the Reddit r/travel subreddit.</div><div><br>You can enter a place you want to visit in the search bar under the \"Where do you want to go?\" banner, and click the <b>Submit</b> button to see pictures of that place. Click on one of the pictures to see a bigger version, and click the arrow keys or buttons to cycle through the rest of the resulting pictures for your place. You can also click the caption next to each picture to go to the post for the picture on the r/travel subreddit.</div><div><br></div><div>If you aren't sure where you want to visit, you can click the Vicarious button at the top of the page to see random pictures. You can also click the <b>Submit</b>&nbsp;button without anything specified in the search bar.</div><div><br></div><div>Have any thoughts on Vicarious? Post them in the comments below!</div>", "comments": []}, {"writer": "UUID", "title": "User Account: Benefits", "timestamp": "2018-02-11T19:12:39.036352+00:00", "content": "Do you have a Crystal Prism user account?<div><br></div><div>If not, here are a few reasons why you should consider creating one:</div><div><br></div><div><ul><li>You can save your scores for Shapes in Rain and Rhythm of Life. You can also appear on the leaderboard of Rhythm of Life.<br></li><li>You can post your own drawings on the CanvaShare gallery and like drawings created by other users.</li><li>You can submit your own posts to the Thought Writer post board and leave comments on others' posts.</li><li>You can create a profile page that has your contact information, an about-me blurb, your scores, your drawings, and your posts for other users to see.</li><li>You can see all of your information and member statistics on your My Account page whenever you like.</li><li>It's fun to be part of a community, and we're excited to have users like you :)</li></ul><div>Creating an account is free, and you can delete it at any time.</div><div><br></div><div>Have any thoughts or questions? Post them in the comments below!</div></div>", "comments": []}, {"writer": "UUID", "title": "User Account: How-To", "timestamp": "2018-02-11T19:22:59.157480+00:00", "content": "If you don't have a Crystal Prism user account yet, here is how you can make one:<div><br></div><div><ol><li>Click the <b>Create Account</b> button on the top-right corner of any page on the Crystal Prism website.<br></li><li>Specify a unique username and a password (at least 8 characters long) for your account.<br></li><li>Click the <b>Submit</b>&nbsp;button. If your username is already taken or if your password isn't long enough, you will see a warning under the username or password field respectively. If your account is created successfully, you will be taken to the My Account page, which has a few menus containing your&nbsp;information.</li><li>Click the <b>Personal</b>&nbsp;menu to see your personal information. Click the <b>Edit</b>&nbsp;button to update information like your username, password, first name, last name, and email address. If you want information to appear on your personal profile page, click the <b>Public?</b> checkbox. You can also change the color of your personal profile page icon by clicking the diamond. You can update the background color of your profile page by clicking the background of the box containing each field of your personal information. Click <b>Save</b>. To see your personal profile, click your username at the top right of any page on the Crystal Prism website if you are logged in. You (and other users) can also see your personal profile by clicking your username under any of your drawings on CanvaShare, under any of your posts on Thought Writer, and next&nbsp;to any of your scores on the Rhythm of Life leaderboard.</li><li>Click the <b>Scores</b>&nbsp;menu to see your Shapes in Rain scores and Rhythm of Life scores. You can play either of these games to save your scores if you don't have any yet.</li><li>Click the <b>Drawings </b>menu to see your CanvaShare drawings. If you don't have any yet, you can go to the CanvaShare page and post one. At the top of the Drawings menu, you can toggle between <b>Mine</b>&nbsp;and <b>Liked</b>&nbsp;to see your own drawings and drawings created by other users that you've liked respectively.</li><li>Click the <b>Posts</b>&nbsp;menu to see your Thought Writer posts. If you don't have any yet, you can go to the Thought Writer page and post one.</li><li>Click the <b>Stats</b>&nbsp;menu to see your member statistics. You can see when you created your account, the number of times you've played Rhythm of Life and Shapes in Rain, the number of CanvaShare drawings you've created and liked, and the number of Thought Writer posts and comments you've created.</li><li>Click the <b>Sign Out </b>button at the top right of any page of the Crystal Prism website to sign out of your account. You will automatically be signed out after an hour.</li></ol><div>Have any questions about user accounts? How about suggestions for features you'd like to see for user accounts? Post them in the comments below!</div></div>", "comments": []}, {"writer": "UUID", "title": "Crystal Prism: Thoughts", "timestamp": "2018-02-11T19:26:31.139108+00:00", "content": "Do you have any thoughts on the Crystal Prism website? Any feedback about the design and/or projects? Any features you'd like to see implemented or bugs you've found that you'd like to get fixed?<div><br></div><div>Post your thoughts in the comments below and/or email <a href=\"mailto:admin@crystalprism.io\" style=\"\"><u><b>admin@crystalprism.io</b></u></a>.</div><div><br></div><div>We look forward to hearing from you!</div>", "comments": []}]
